{"pageProps":{"data":{"title":"What's going on?"},"html":"","sections":[{"key":"WhatIsGPC","data":{"title":"What is GPC?"},"html":"<p>GPC is a way users can universally express, to all sites, their preference not\nto be tracked on the web. It is a browser-level signal, maintained either by a\nbrowser or browser extension, that a user or privacy-focused technology can set.\nThe easiest way to think of GPC is as a robot that selects the Do Not Sell\npreference on a site on behalf of a user. The open source tool was developed by\na coalition of advocates, academics, and companies to allow users to exercise\nnew rights to opt out of data sharing at scale.</p>\n<p>Sites that detect GPC may interpret the signal in a variety of ways depending\non their interpretation of the privacy laws applicable to the site. Some sites\nuse GPC to turn off all third party user tracking regardless of location, others\nuse it as a tool to limit certain data sharing in only some jurisdictions.\nRegardless of such use, it is now recognized as a way to express Do Not Sell\npreference under the CCPA. <a href=\"https://berjon.com/gpc-under-the-gdpr/\">GPC</a> may\nalso have legal effects under other legal regimes, including in Europe under the\nGDPR. However, this document focuses on its relevance under the CCPA.</p>\n"},{"key":"WhatDoesEnforcementMean","data":{"title":"What does the enforcement of GPC mean for site maintainers?"},"html":"<p>Websites that employ third party systems for the tracking of users for ad targeting\nor other commercial purposes will now need to take steps to honor GPC choices,\ncreating an automated flow that takes the signal and uses it to mark the session\nas Do Not Sell as defined under CCPA, potentially through using compatible systems\nlike the IAB’s <a href=\"https://github.com/InteractiveAdvertisingBureau/USPrivacy/blob/master/CCPA/USP%20API.md\">USP API</a>.\nIf the business knows the identity of the user, the “Do Not Sell” applies to all\nuses of the person’s information, not just the web session.</p>\n<p>Because the GPC is on a window-level object and on request headers, its presence is\nthe fastest way to handle decision-making around user privacy. GPC has been adopted\nby The Washington Post, The New York Times, and a variety of other publishers. It\nalso is supported by a number of major Consent Management Platforms (CMPs),\nincluding OneTrust, SourcePoint, and WireWheel. GPC simplifies the process of user\nopt out. It does so without adding technical complexity that could slow ad execution.\nThe ease of execution means that GPC is a positive development for helping sites\nfollow CCPA regulations.</p>\n"},{"key":"ExpectedImpact","data":{"title":"Expected Impact"},"html":"<p>As of the writing of this document over 40 million users are utilizing a browser or\nextension with GPC support. Some systems that allow the user to express their\nprivacy preference with GPC are Abine, Brave, DuckDuckGo, OptMeowt, and Privacy Badger.</p>\n<p>Impact on your site will depend on your interpretation of the CCPA and CPRA. There\nare open questions about what specific processing activities are covered by an opt-out\nrequest under those laws; the California Privacy Protection Agency is currently\ndrafting rules to provide more clarity to implementers, but those rules have not been\nfinalized. Not all of those 40 million users are in California, and if you limit your\nprocessing of GPC to California, the percentage of users using it will depend on how\nmuch of your traffic you get from California. However, if you accept GPC beyond\nCalifornia, it may result in a larger impact.</p>\n<p>To understand the impact on your individual site, we generally recommend tracking the\npercentage of users activating a GPC signal as a non-user-identified metric in your\nsite’s analytics.</p>\n"},{"key":"ImplementationGuidance","data":{"title":"Implementation Guidance"},"html":"<p>What follows are known best-practices for site-owners and publishers to implement GPC\nparsing in a way that brings them in compliance with the CCPA. A site may choose to\nfurther implement GPC by using the signal for other regions’ regulations, or as a\ngeneral user preference to be used across all sessions, but that functionality is\nhighly varied from site to site and not described here.</p>\n<p>Importantly, GPC is convenient to implement as a stateless protocol. Sites do not need\nto keep track of a user’s status being opted out as every request will contain it.</p>\n"},{"key":"Transparency","data":{"title":"Transparency: Implementing .well-known/gpc.json and Privacy Policy Update"},"html":"<p>GPC makes use of <a href=\"https://datatracker.ietf.org/doc/html/rfc5785\"><em>.well-known</em> identifiers</a>\nfor sites to signal compliance with the <a href=\"https://privacycg.github.io/gpc-spec/\">GPC specification</a>.\nThe existence of this file indicates you are using GPC as part of your compliance with\nprivacy laws. There may be a variety of tools for implementing <em>.well-known</em> files in\nyour Content Management System (CMS) or website. Here is an <a href=\"https://github.com/pfefferle/wordpress-well-known\">example for WordPress</a>\nand another <a href=\"https://www.npmjs.com/package/gatsby-plugin-well-known\">for Gatsby</a>. If\nyou can find a method of implementing <code>.well-known/gpc.json</code> that is native to your\nCMS, we recommend you do so. What follows is a basic example assuming you have the\ncapability to designate a static folder and files for your site.</p>\n<p>First create a folder named <code>.well-known</code> at the base of your site, so it would have\na path of <code>yoursite.com/.well-known/</code>. In that folder create a file with the name of\n<code>gpc.json</code>. The file’s value should then look something like this with <code>lastUpdate</code>\nset to the date you have last updated the file.</p>\n<pre><code>{\n    \"gpc\": true,\n    \"lastUpdate\": \"2022-04-20\"\n}\n</code></pre>\n<p>This will give you a valid GPC file that states you comply with GPC within the\ncontext you understand it to apply.</p>\n<p>Adopters will usually supplement the <em>.well-known</em> file with a statement in their\nPrivacy Policy that states exactly how they interpret GPC within their own systems.\nThe exact message in your privacy policy is up to you and may require review by your\nlegal team. A suggested addition, similar to the <a href=\"https://www.nytimes.com/privacy/california-notice\">privacy policy of The New York Times</a>:</p>\n<blockquote>\n<p>“Finally, if your browser supports it, you can turn on the Global Privacy Control to opt-out of the “sale” of your personal information under California’s CCPA.”</p>\n</blockquote>\n"},{"key":"USPAPI","data":{"title":"Changing Data Sharing Practices: Implementing the GPC signal with the IAB’s USP API"},"html":"<p>The USP API is a method of compliance recommended by the IAB. While there are other\nways to comply with CCPA, the USP API is the most commonly used so instructions for\nsyncing GPC with the USP API follow. If you use a CMP, it is highly likely that\nyour use of the USP API is dependent on their system. Before moving forward with\nthe guidance below, check with your CMP to see if they support GPC and if they\nprovide a way to turn that support on. <a href=\"https://my.onetrust.com/s/article/UUID-7c78b8b2-8399-d284-b9e9-fe4ec44e8aed?language=en_US\">If you are using OneTrust, here is a link to how you can turn on GPC support</a>.\nYour CMS may also include tools to comply with GPC. <a href=\"https://www.npmjs.com/package/express-gpc\">Here’s an example for Express-based NodeJS applications</a>.</p>\n<p>The following example relies on the assumption that the page accepting the signal\nis doing so in concert with the IAB's CCPA Framework and has given the user\nexplicit notice somewhere on their page. This sample script does not include\nother methods by which you may monitor and set the CCPA preference of a user. It\nshould be placed as early on the page as possible to gain the maximum performance\nresult from leveraging GPC.</p>\n<pre><code>// This will cover cases where it is set to null or set.\n// In the case of older user agents, it should not be assumed that the lack of a signal is equivalent to permission to sell.\n    if (navigator.globalPrivacyControl){\n        var CCPAConsent = ''\n        switch (navigator.globalPrivacyControl) {\n            case \"1\":\n                // Y indicates the user has selected opt out\n                CCPAConsent = 'Y';\n                break;\n            default:\n                // N indicates the user has not selected to opt out\n                CCPAConsent = 'N';\n        }\n        var uspFramework = {\n            version: 1,\n            notice: 'Y',\n            optOut: CCPAConsent, // You will have other things\n                                 // besides GPC that are likely to\n                                 // set this value.\n            lspa: 'Y'\n        }\n        // Will return a USP string like `1YYY`\n        var uspString = Object.values(uspFramework).reduce((a, c) => { return a+c }, '')\n        window.__uspapi = (command, version, callback) => {\n            if (command === 'getUSPData' &#x26;&#x26; version === 1) {\n                callback(uspString, true)\n            }\n        }\n    } else {\n        // Standard logic for handling CCPA without the navigator.globalPrivacyControl setting.\n    }\n</code></pre>\n"},{"key":"Results","data":{"title":"Results"},"html":"<p>Because of its presence at the level of the browser and its immediate availability,\nrequests with GPC where CCPA has to be followed have a significantly lower time to\nfirst ad load.</p>\n"}]},"__N_SSG":true}